RhinoInside.Revit API Documentation
GeometryEncoder.ToPolyLine Method
 Converts the specified Rhino.Geometry.Polyline to an equivalent of Autodesk.Revit.DB.PolyLine.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.PolyLine ToPolyLine(
	this Rhino.Geometry.Polyline polyline
)
@staticmethod
def ToPolyLine(
	polyline: Rhino.Geometry.Polyline
) -> Autodesk.Revit.DB.PolyLine
Parameters
polyline
Type: Rhino.Geometry.Polyline
Rhino polyline to convert.
Return Value
Type: Autodesk.Revit.DB.PolyLine
Revit polyline that is equivalent to the provided Rhino polyline.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Polyline. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPolyLine(Polyline) as extension method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.PolyLine revitPolyLine = rhinoPolyLine.ToPolyLine();
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry
6clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
7
8revit_polyline: DB.PolyLine = rhino_polyline.ToPolyLine()
 Using ToPolyLine(Polyline) as static method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.PolyLine revitPolyLine = GeometryEncoder.ToPolyLine(rhinoPolyLine);
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as ge
6
7revit_polyline: DB.PolyLine = ge.ToPolyLine(rhino_polyline)
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace